src/cf/src/Documents/ВозвратОтПокупателяНалоговый/ВозвратОтПокупателяНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратОтПокупателяНалоговый</name>
  <basedOn>Document.НалоговаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.НалоговаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>CatalogRef.ПричиныВозвратов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ВозвратОтПокупателяНалоговый/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ВидЦены = Объект.Договор.ВидЦены;
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Основание) Тогда
		Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
	КонецЕсли;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	ПересчитатьСтрокиПоРежимуНДС();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	КонтрагентПриИзменении(Элемент);
КонецПроцедуры  

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	ОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные; 
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыКоличество Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ЗначениеЗаполнено(ТекСтр.Упаковка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеализации(Команда)
	СписокТоваров = ПолучитьСписокТоваровРеализацииНаСервере();
	Оп  = Новый ОписаниеОповещения("ПослеВыбораТоваровДляВозврата",ЭтаФорма);
	СписокТоваров.ПоказатьОтметкуЭлементов(Оп,НСтр("fr = 'Sélectionnez les éléments à retourner'; ru = 'Выберите элементы для возврата'; en = 'Select items to return'; es = 'Seleccione los artículos que desea devolver'"));
	ЗаполнитьПоРеализацииНаСервере(СписокТоваров);
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеВыбораТоваровДляВозврата(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда возврат; КонецЕсли;
	Объект.ТЧТовары.Очистить();
	ЗаполнитьПоРеализацииНаСервере(Результат); 
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ОснованиеПриИзмененииНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Заполнить(Об.Основание);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры
 
&НаСервере
Процедура УстановитьЦеныНаСервере()
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата, Объект.ЦенаВключаетНДС,
		Объект.Контрагент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРеализацииНаСервере(СписокТоваров)
	ТЗОснование = Объект.Основание.ТЧТовары.Выгрузить();
	Для Каждого Стр из СписокТоваров Цикл
		Если Не Стр.ПОметка Тогда Продолжить; КонецЕсли;
		Если Не Объект.ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура",Стр.Значение)).Количество() = 0 Тогда Продолжить; КонецЕсли;
		СтрОснование = ТЗОснование.Найти(Стр.Значение);
		Если СтрОснование = Неопределено Тогда Продолжить; КонецЕсли;
		НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,СтрОснование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТоваровРеализацииНаСервере()
	СписокТоваров = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалоговаяНакладнаяТЧТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.НалоговаяНакладная.ТЧТовары КАК НалоговаяНакладнаяТЧТовары
	|ГДЕ
	|	НалоговаяНакладнаяТЧТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокТоваров.Добавить(Выборка.Номенклатура, ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура,Неопределено),Ложь);
	КонецЦикла;
	Возврат СписокТоваров;
КонецФункции

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
	Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиПоРежимуНДС()
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
